# Importing required notebooks

In [11]:
# import requests

# Importing notebook with annotations

# url = 'https://raw.githubusercontent.com/hamidov9jat/zero-to-mastery-ml/master/section-2-data-science-and-ml-tools/introduction-to-pandas.ipynb'
# r = requests.get(url, allow_redirects=True)
# open('introduction-to-pandas.ipynb', 'wb').write(r.content)

# Importing notebook from video

# url = 'https://raw.githubusercontent.com/hamidov9jat/zero-to-mastery-ml/master/section-2-data-science-and-ml-tools/introduction-to-pandas-video.ipynb'
# r = requests.get(url, allow_redirects=True)
# open('introduction-to-pandas-video.ipynb', 'wb').write(r.content)

# Importing exercise notebook

# url = 'https://raw.githubusercontent.com/hamidov9jat/zero-to-mastery-ml/master/section-2-data-science-and-ml-tools/pandas-exercises.ipynb'
# r = requests.get(url, allow_redirects=True)
# open('pandas-exercises.ipynb', 'wb').write(r.content)

# Importing solutions notebook

# url = 'https://raw.githubusercontent.com/hamidov9jat/zero-to-mastery-ml/master/section-2-data-science-and-ml-tools/pandas-exercises-solutions.ipynb'
# r = requests.get(url, allow_redirects=True)
# open('pandas-exercises-solutions.ipynb', 'wb').write(r.content)

250445

# Looking at Car Sales

In [ ]:
# Import data

# url = 'https://raw.githubusercontent.com/hamidov9jat/zero-to-mastery-ml/master/data/car-sales.csv'
# r = requests.get(url, allow_redirects=True)
# open('car-sales.csv', 'wb').write(r.content)

369

In [2]:
import pandas as pd

In [3]:
car_sales = pd.read_csv('car-sales.csv')
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [9]:
# Exporting a dataframe
car_sales.to_csv('exported_car_sales.csv', index=False)

In [10]:
exported_car_sales = pd.read_csv('exported_car_sales.csv')
exported_car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

# Describe data

In [12]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [23]:
type(car_sales.dtypes.values)

numpy.ndarray

In [24]:
car_sales.dtypes.values

array([dtype('O'), dtype('O'), dtype('int64'), dtype('int64'), dtype('O')],
      dtype=object)

In [25]:
car_sales.dtypes.index

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [13]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [14]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [15]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [16]:
car_sales.shape

(10, 5)

In [17]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [18]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [19]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes